# Оля
def point(n):
    # Помещение собаки в город на рандомные координаты
    # return x,y
    pass


# Игорь
def up(x, y):
    pass


# Игорь
def down(x, y):
    pass


# Игорь
def right(x, y):
    pass


# Игорь
def left(x, y):
    pass


# Игорь
def walk(x, y):
    # Шаг собаки
    pass


# Оля
def blind_alley(x, y):
    # (Тупик)
    # Проверка всех направлений на то была ли там собака
    pass


# Оля
def border(x, y):
    # проверка на границу города
    # Заканчивается ли таблица с одной из сторон
    pass


# Игорь
def dog(n):
    #  Просчитывает одно путешествие собаки в городе
    pass


# Арсений
if __name__ == '__main__':
    # Множество повторений функции и вероятность
    pass
